(() => {
    let ώρα = prompt('Ώρα: '),
        λεπτά = prompt('Λεπτά: '),
        είδος = prompt('π.μ. ή μ.μ. : '),
        ταυτότηταΛούπας; // για την επανάληψη

    try {
        ώρα = JSON.parse(ώρα);
        λεπτά = JSON.parse(λεπτά);
    }
    catch (σφάλμα) {
        alert('Κάτι δεν πήγε σωστά..');
    }

    let ήχοςΞυπνητηριού = new Howl({
        src: ['/THE_BEEP.mp3'],
        loop: true
    });

    if (typeof (ώρα) == 'number' && typeof (λεπτά) == 'number') {
        if (["pm", "μ.μ.", "μ.μ", "μμ", "μμ."].includes(είδος.toLowerCase())) ώρα += 12; // Βάλε 12ωρο άν είναι μμ

        ταυτότηταΛούπας = setInterval(() => {
            // Συνεχόμενα διάβαζε την ώρα μέχρι να γίνει η ζητούμενη του χρήστη.
            if (ώρα == new Date().getHours() && λεπτά == new Date().getMinutes()) {
                ήχοςΞυπνητηριού.play();
                clearInterval(ταυτότηταΛούπας); // Σπάσε την επανάληψη
                document.write('<h1>ΞΥΠΝΑΑΑΑΑΑΑΑ</h1><br>' + `<h1>${ώρα}:${λεπτά}${είδος}</h1>`);
            }
        }, 1e3); // 1 sec repeat.

    }

    else alert('Ρε αριθμό σου ζήτησα');
})();